vector3:
  description: A vector with 3 components.
  properties:
    - name: x
      type: Number
      description: The first component of the vector.
    - name: y
      type: Number
      description: The second component of the vector.
    - name: z
      type: Number
      description: The third component of the vector.
  class_properties:
    - name: zero
      type: Vector3
      description: A Vector3 with all components equal to 0.
      example: |-
        Vector3.zero
        // Vector3 { x: 0, y: 0, z: 0 }
    - name: one
      type: Vector3
      description: A Vector3 with all components equal to 1.
      example: |-
        Vector3.one
        // Vector3 { x: 1, y: 1, z: 1 }
    - name: unitX
      type: Vector3
      description: A Vector3 with unit length along the x axis.
      example: |-
        Vector3.unitX
        // Vector3 { x: 1, y: 0, z: 0 }
    - name: unitY
      type: Vector3
      description: A Vector3 with unit length along the y axis.
      example: |-
        Vector3.unitY
        // Vector3 { x: 0, y: 1, z: 0 }
    - name: unitZ
      type: Vector3
      description: A Vector3 with unit length along the z axis.
      example: |-
        Vector3.unitZ
        // Vector3 { x: 0, y: 0, z: 1 }
  methods:
    - name: set
      type: Vector3
      description: Sets the value of each component of the vector.
      returns: A reference to itself.
      arguments:
        - name: x
          type: Number
          description: The value to set the first component of the vector.
      example: |-
        const u = new Vector3()
        u.set(1, 2, 3)
        // Vector3 { x: 1, y: 2, z: 3 }
    - name: setX
      type: Vector3
      description: Sets the value of the first component of the vector.
      returns: A reference to itself.
      arguments:
        - name: value
          type: Number
          description: The value to set.
      example: |-
        const u = new Vector3()
        u.setX(5)
        // Vector3 { x: 5, y: 0, z: 0 }
    - name: setY
      type: Vector3
      description: Sets the value of the second component of the vector.
      returns: A reference to itself.
      arguments:
        - name: value
          type: Number
          description: The value to set.
      example: |-
        const u = new Vector3()
        u.setY(5)
        // Vector3 { x: 0, y: 5, z: 0 }
    - name: setZ
      type: Vector3
      description: Sets the value of the third component of the vector.
      returns: A reference to itself.
      arguments:
        - name: value
          type: Number
          description: The value to set.
      example: |-
        const u = new Vector3()
        u.setZ(5)
        // Vector3 { x: 0, y: 0, z: 5 }
