name: Vector3
description: A vector with 3 components.
properties:
  - name: x
    type: Number
    description: The first component of the vector.
  - name: y
    type: Number
    description: The second component of the vector.
  - name: z
    type: Number
    description: The third component of the vector.
class_properties:
  - name: zero
    type: Vector3
    description: A Vector3 with all components equal to 0.
    example: |-
      Vector3.zero
      // Vector3 { x: 0, y: 0, z: 0 }
  - name: one
    type: Vector3
    description: A Vector3 with all components equal to 1.
    example: |-
      Vector3.one
      // Vector3 { x: 1, y: 1, z: 1 }
  - name: unitX
    type: Vector3
    description: A Vector3 with unit length along the x axis.
    example: |-
      Vector3.unitX
      // Vector3 { x: 1, y: 0, z: 0 }
  - name: unitY
    type: Vector3
    description: A Vector3 with unit length along the y axis.
    example: |-
      Vector3.unitY
      // Vector3 { x: 0, y: 1, z: 0 }
  - name: unitZ
    type: Vector3
    description: A Vector3 with unit length along the z axis.
    example: |-
      Vector3.unitZ
      // Vector3 { x: 0, y: 0, z: 1 }
methods:
  - name: set
    type: Vector3
    description: Sets the value of each component of the vector.
    returns: A reference to itself.
    arguments:
      - name: x
        type: Number
        description: The value to set the first component of the vector.
      - name: y
        type: Number
        description: The value to set the second component of the vector.
      - name: z
        type: Number
        description: The value to set the third component of the vector.
    example: |-
      const u = new Vector3()
      u.set(1, 2, 3)
      // Vector3 { x: 1, y: 2, z: 3 }
  - name: setX
    type: Vector3
    description: Sets the value of the first component of the vector.
    returns: A reference to itself.
    arguments:
      - name: value
        type: Number
        description: The value to set.
    example: |-
      const u = new Vector3()
      u.setX(5)
      // Vector3 { x: 5, y: 0, z: 0 }
  - name: setY
    type: Vector3
    description: Sets the value of the second component of the vector.
    returns: A reference to itself.
    arguments:
      - name: value
        type: Number
        description: The value to set.
    example: |-
      const u = new Vector3()
      u.setY(5)
      // Vector3 { x: 0, y: 5, z: 0 }
  - name: setZ
    type: Vector3
    description: Sets the value of the third component of the vector.
    returns: A reference to itself.
    arguments:
      - name: value
        type: Number
        description: The value to set.
    example: |-
      const u = new Vector3()
      u.setZ(5)
      // Vector3 { x: 0, y: 0, z: 5 }
  - name: copy
    type: Vector3
    description: Copies the values of the components of another vector.
    returns: A reference to itself.
    arguments:
      - name: vector
        type: Vector3
        description: The vector to copy the values from.
    example: |-
      const u = new Vector3()
      const v = new Vector3(1, 2, 3)
      u.copy(v)
      // Vector3 { x: 1, y: 2, z: 3 }
  - name: clone
    type: Vector3
    description: Creates a clone of the vector.
    returns: A clone of the vector.
    example: |-
      const u = new Vector3(1, 2, 3)
      const v = u.clone()
      v
      // Vector3 { x: 1, y: 2, z: 3 }
      v === u
      // false
  - name: negate
    type: Vector3
    description: Inverts the values of each component of the vector.
    returns: A reference to itself.
    example: |-
      const u = new Vector3(1, 2, 3)
      u.negate()
      // Vector3 { x: -1, y: -2, z: -3 }
  - name: negateVector
    type: Vector3
    description: Sets the components to the negated values of another vector.
    returns: A reference to itself.
    arguments:
      - name: vector
        type: Vector3
        description: The vector to negate.
    example: |-
      const u = new Vector3()
      const v = new Vector3(1, 2, 3)
      u.negate(v)
      // Vector3 { x: -1, y: -2, z: -3 }
  - name: add
    type: Vector3
    description: Adds the components of another vector.
    returns: A reference to itself.
    arguments:
      - name: vector
        type: Vector3
        description: The vector to add.
    example: |-
      const u = new Vector3(1, 2, 3)
      const v = new Vector3(4, 5, 6)
      u.add(v)
      // Vector3 { x: 5, y: 7, z: 9 }
  - name: addScalar
    type: Vector3
    description: Adds a scalar to each component of the vector.
    returns: A reference to itself.
    arguments:
      - name: s
        type: Number
        description: The scalar to add.
    example: |-
      const u = new Vector3(1, 2, 3)
      u.add(4)
      // Vector3 { x: 5, y: 6, z: 7 }
  - name: addValues
    type: Vector3
    description: Adds a value to each component of the vector.
    returns: A reference to itself.
    arguments:
      - name: x
        type: Number
        description: The value to add to the first component of the vector.
      - name: y
        type: Number
        description: The value to add to the second component of the vector.
      - name: z
        type: Number
        description: The value to add to the third component of the vector.
    example: |-
      const u = new Vector3(1, 2, 3)
      u.addValues(4, 5, 6)
      // Vector3 { x: 5, y: 7, z: 9 }
  - name: addVectors
    type: Vector3
    description: Sets the vector to the addition of two other vectors.
    returns: A reference to itself.
    arguments:
      - name: u
        type: Vector3
        description: The first vector.
      - name: v
        type: Vector3
        description: The second vector.
    example: |-
      const vector = new Vector3()
      const u = new Vector3(1, 2, 3)
      const v = new Vector3(4, 5, 6)
      vector.addVectors(u, v)
      // Vector3 { x: 5, y: 7, z: 9 }
